Documents/ДоговорСКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДоговорСКлиентом</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДоговорСКлиентом/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.ВидДоговора)
	Тогда
		УстановитьДатуОкончанияПоВидуДоговора(Объект.ДатаОкончания, Объект.ВидДоговора, Объект.Дата);
	КонецЕсли;
	
	ОбработатьКонтекстВыбораСоздания_ПриСозданииНаСервере();
	
	// Установка текущего элемента исходя из заполненности полей.
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ТекущийЭлемент = Элементы.ВидДоговора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбработатьКонтекстВыбораСоздания_ПослеЗаписиНаСервере();
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			
			Объект.Клиент = ВыбранноеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиента(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,Элементы.Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоШаблону(Команда)
	
	СодержаниеОшибки = "";
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		Результат = РаботаСШаблонамиПечатиКлиент.ВыполнитьПечатьДокументаПоШаблонуПечати(Объект.Ссылка,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидДоговора,"ШаблонПечати") , СодержаниеОшибки, мУчетнаяПолитика.РежимПечатиПоШаблонуWORD);
		Если Не Результат Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СодержаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПодбора = Новый Структура("Отбор, СтрокаПоиска, ВыборГруппИЭлементов");
	
	ПараметрыПодбора.СтрокаПоиска = Текст;
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Клиенты"), ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда

		СтандартнаяОбработка = Ложь;
		
		ПараметрыПодбора = Новый Структура("Отбор, СтрокаПоиска, ВыборГруппИЭлементов");
		
		ПараметрыПодбора.СтрокаПоиска = Текст;
		
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Клиенты"), ПараметрыПодбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	УстановитьДатуОкончанияПоВидуДоговора(Объект.ДатаОкончания, Объект.ВидДоговора, Объект.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДатуОкончанияПоВидуДоговора(ДатаОкончания, ВидДоговора, ДатаДокумента)
	
	Если ЗначениеЗаполнено(ВидДоговора) Тогда
		СрокДействия = ДопСерверныеФункции.ПолучитьРеквизит(ВидДоговора, "СрокДействия");
		Если ЗначениеЗаполнено(СрокДействия) Тогда
			ДатаОкончания = ДобавитьМесяц(ДатаДокумента, СрокДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьКонтекстВыбораСоздания_ПриСозданииНаСервере()
	
	Если Параметры.ДополнительныеПараметры.Свойство("КонтекстВыбораСоздания") Тогда
		
		КонтекстВыбораСоздания = Параметры.ДополнительныеПараметры.КонтекстВыбораСоздания;
		Если КонтекстВыбораСоздания = КонтекстВыбораСоздания_Медосмотр() Тогда
		
			Если Объект.ВидДоговора.Пустая() Тогда
				ЗначениеНастройки = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ДоговорСКлиентом", "ВидДоговораМедосмотры");
				Объект.ВидДоговора = ЗначениеНастройки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьКонтекстВыбораСоздания_ПослеЗаписиНаСервере()
	
	Если КонтекстВыбораСоздания = КонтекстВыбораСоздания_Медосмотр() Тогда
		Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
			РаботаСФормамиСервер.СохранитьНастройкуФормы("ДоговорСКлиентом", "ВидДоговораМедосмотры", Объект.ВидДоговора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция КонтекстВыбораСоздания_Медосмотр()
	Возврат "Документ.ПрохождениеМедосмотра.Форма.ФормаДокумента";
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
